package yijing

type 五行 struct {
	名 string
}

var (
	金 = 五行{名: "金"}
	木 = 五行{名: "木"}
	水 = 五行{名: "水"}
	火 = 五行{名: "火"}
	土 = 五行{名: "土"}
)

func (wx 五行) 克() 五行 {
	switch wx {
	case 金:
		return 木
	case 木:
		return 土
	case 水:
		return 火
	case 火:
		return 金
	case 土:
		return 水
	}
	return 五行{}
}

func (wx 五行) 生() 五行 {
	switch wx {
	case 金:
		return 水
	case 木:
		return 火
	case 水:
		return 木
	case 火:
		return 土
	case 土:
		return 金
	}
	return 五行{}
}

type 阴阳 struct {
	名 string
}

var (
	阴 = 阴阳{名: "阴"}
	阳 = 阴阳{名: "阳"}
)

type 天干 struct {
	名  string
	五行 五行
	阴阳 阴阳
}

var (
	甲 = 天干{名: "甲", 五行: 木, 阴阳: 阳}
	乙 = 天干{名: "乙", 五行: 木, 阴阳: 阴}
	丙 = 天干{名: "丙", 五行: 火, 阴阳: 阳}
	丁 = 天干{名: "丁", 五行: 火, 阴阳: 阴}
	戊 = 天干{名: "戊", 五行: 土, 阴阳: 阳}
	己 = 天干{名: "己", 五行: 土, 阴阳: 阴}
	庚 = 天干{名: "庚", 五行: 金, 阴阳: 阳}
	辛 = 天干{名: "辛", 五行: 金, 阴阳: 阴}
	壬 = 天干{名: "壬", 五行: 水, 阴阳: 阳}
	癸 = 天干{名: "癸", 五行: 水, 阴阳: 阴}
)

type 地支 struct {
	名  string
	五行 五行
	阴阳 阴阳
	藏干 []天干
}

var (
	子 = 地支{名: "子", 五行: 水, 阴阳: 阳, 藏干: []天干{癸}}
	丑 = 地支{名: "丑", 五行: 土, 阴阳: 阴, 藏干: []天干{己, 辛, 癸}}
	寅 = 地支{名: "寅", 五行: 木, 阴阳: 阳, 藏干: []天干{甲, 丙, 戊}}
	卯 = 地支{名: "卯", 五行: 木, 阴阳: 阴, 藏干: []天干{乙}}
	辰 = 地支{名: "辰", 五行: 土, 阴阳: 阳, 藏干: []天干{乙, 戊, 癸}}
	巳 = 地支{名: "巳", 五行: 火, 阴阳: 阴, 藏干: []天干{丙, 戊, 庚}}
	午 = 地支{名: "午", 五行: 火, 阴阳: 阳, 藏干: []天干{丁, 己}}
	未 = 地支{名: "未", 五行: 土, 阴阳: 阴, 藏干: []天干{乙, 丁, 己}}
	申 = 地支{名: "申", 五行: 金, 阴阳: 阳, 藏干: []天干{戊, 庚, 壬}}
	酉 = 地支{名: "酉", 五行: 金, 阴阳: 阴, 藏干: []天干{辛}}
	戌 = 地支{名: "戌", 五行: 土, 阴阳: 阳, 藏干: []天干{丁, 戊, 辛}}
	亥 = 地支{名: "亥", 五行: 水, 阴阳: 阴, 藏干: []天干{甲, 壬}}
)
