package yijing

var (
	比肩 = 十神{
		名:  "比肩",
		简称: "比",
		别名: "",
		吉凶: 吉,
	}
	劫财 = 十神{
		名:  "劫财",
		简称: "劫",
		别名: "",
		吉凶: 凶,
	}
	偏财 = 十神{
		名:  "偏财",
		简称: "财",
		别名: "",
		吉凶: 吉,
	}
	正财 = 十神{
		名:  "正财",
		简称: "才",
		别名: "",
		吉凶: 吉,
	}
	食神 = 十神{
		名:  "食神",
		简称: "食",
		别名: "",
		吉凶: 吉,
	}
	伤官 = 十神{
		名:  "伤官",
		简称: "伤",
		别名: "",
		吉凶: 凶,
	}
	七杀 = 十神{
		名:  "七杀",
		简称: "杀",
		别名: "偏官",
		吉凶: 凶,
	}
	正官 = 十神{
		名:  "正官",
		简称: "官",
		别名: "",
		吉凶: 吉,
	}
	偏印 = 十神{
		名:  "偏印",
		简称: "枭",
		别名: "枭神",
		吉凶: 凶,
	}
	正印 = 十神{
		名:  "正印",
		简称: "印",
		别名: "",
		吉凶: 吉,
	}
)

type 十神 struct {
	名  string
	简称 string
	别名 string
	吉凶 吉凶
}

func (ss 十神) String() string {
	return ss.名
}