package yijing

var (
	子 = 地支{名: "子", 五行: 水, 阴阳: 阳, 藏干: []天干{癸}}
	丑 = 地支{名: "丑", 五行: 土, 阴阳: 阴, 藏干: []天干{己, 辛, 癸}}
	寅 = 地支{名: "寅", 五行: 木, 阴阳: 阳, 藏干: []天干{甲, 丙, 戊}}
	卯 = 地支{名: "卯", 五行: 木, 阴阳: 阴, 藏干: []天干{乙}}
	辰 = 地支{名: "辰", 五行: 土, 阴阳: 阳, 藏干: []天干{乙, 戊, 癸}}
	巳 = 地支{名: "巳", 五行: 火, 阴阳: 阴, 藏干: []天干{丙, 戊, 庚}}
	午 = 地支{名: "午", 五行: 火, 阴阳: 阳, 藏干: []天干{丁, 己}}
	未 = 地支{名: "未", 五行: 土, 阴阳: 阴, 藏干: []天干{乙, 丁, 己}}
	申 = 地支{名: "申", 五行: 金, 阴阳: 阳, 藏干: []天干{戊, 庚, 壬}}
	酉 = 地支{名: "酉", 五行: 金, 阴阳: 阴, 藏干: []天干{辛}}
	戌 = 地支{名: "戌", 五行: 土, 阴阳: 阳, 藏干: []天干{丁, 戊, 辛}}
	亥 = 地支{名: "亥", 五行: 水, 阴阳: 阴, 藏干: []天干{甲, 壬}}
)

type 地支 struct {
	名  string
	五行 五行
	阴阳 阴阳
	藏干 []天干
}
