package yijing

var (
	甲子 = 柱{
		天干: 甲,
		地支: 子,
	}
	乙丑 = 柱{
		天干: 乙,
		地支: 丑,
	}
	丙寅 = 柱{
		天干: 丙,
		地支: 寅,
	}
	丁卯 = 柱{
		天干: 丁,
		地支: 卯,
	}
	戊辰 = 柱{
		天干: 戊,
		地支: 辰,
	}
	己巳 = 柱{
		天干: 己,
		地支: 巳,
	}
	庚午 = 柱{
		天干: 庚,
		地支: 午,
	}
	辛未 = 柱{
		天干: 辛,
		地支: 未,
	}
	壬申 = 柱{
		天干: 壬,
		地支: 申,
	}
	癸酉 = 柱{
		天干: 癸,
		地支: 酉,
	}
	甲戌 = 柱{
		天干: 甲,
		地支: 戌,
	}
	乙亥 = 柱{
		天干: 乙,
		地支: 亥,
	}
	丙子 = 柱{
		天干: 丙,
		地支: 子,
	}
	丁丑 = 柱{
		天干: 丁,
		地支: 丑,
	}
	戊寅 = 柱{
		天干: 戊,
		地支: 寅,
	}
	己卯 = 柱{
		天干: 己,
		地支: 卯,
	}
	庚辰 = 柱{
		天干: 庚,
		地支: 辰,
	}
	辛巳 = 柱{
		天干: 辛,
		地支: 巳,
	}
	壬午 = 柱{
		天干: 壬,
		地支: 午,
	}
	癸未 = 柱{
		天干: 癸,
		地支: 未,
	}
	甲申 = 柱{
		天干: 甲,
		地支: 申,
	}
	乙酉 = 柱{
		天干: 乙,
		地支: 酉,
	}
	丙戌 = 柱{
		天干: 丙,
		地支: 戌,
	}
	丁亥 = 柱{
		天干: 丁,
		地支: 亥,
	}
	戊子 = 柱{
		天干: 戊,
		地支: 子,
	}
	己丑 = 柱{
		天干: 己,
		地支: 丑,
	}
	庚寅 = 柱{
		天干: 庚,
		地支: 寅,
	}
	辛卯 = 柱{
		天干: 辛,
		地支: 卯,
	}
	壬辰 = 柱{
		天干: 壬,
		地支: 辰,
	}
	癸巳 = 柱{
		天干: 癸,
		地支: 巳,
	}
	甲午 = 柱{
		天干: 甲,
		地支: 午,
	}
	乙未 = 柱{
		天干: 乙,
		地支: 未,
	}
	丙申 = 柱{
		天干: 丙,
		地支: 申,
	}
	丁酉 = 柱{
		天干: 丁,
		地支: 酉,
	}
	戊戌 = 柱{
		天干: 戊,
		地支: 戌,
	}
	己亥 = 柱{
		天干: 己,
		地支: 亥,
	}
	庚子 = 柱{
		天干: 庚,
		地支: 子,
	}
	辛丑 = 柱{
		天干: 辛,
		地支: 丑,
	}
	壬寅 = 柱{
		天干: 壬,
		地支: 寅,
	}
	癸卯 = 柱{
		天干: 癸,
		地支: 卯,
	}
	甲辰 = 柱{
		天干: 甲,
		地支: 辰,
	}
	乙巳 = 柱{
		天干: 乙,
		地支: 巳,
	}
	丙午 = 柱{
		天干: 丙,
		地支: 午,
	}
	丁未 = 柱{
		天干: 丁,
		地支: 未,
	}
	戊申 = 柱{
		天干: 戊,
		地支: 申,
	}
	己酉 = 柱{
		天干: 己,
		地支: 酉,
	}
	庚戌 = 柱{
		天干: 庚,
		地支: 戌,
	}
	辛亥 = 柱{
		天干: 辛,
		地支: 亥,
	}
	壬子 = 柱{
		天干: 壬,
		地支: 子,
	}
	癸丑 = 柱{
		天干: 癸,
		地支: 丑,
	}
	甲寅 = 柱{
		天干: 甲,
		地支: 寅,
	}
	乙卯 = 柱{
		天干: 乙,
		地支: 卯,
	}
	丙辰 = 柱{
		天干: 丙,
		地支: 辰,
	}
	丁巳 = 柱{
		天干: 丁,
		地支: 巳,
	}
	戊午 = 柱{
		天干: 戊,
		地支: 午,
	}
	己未 = 柱{
		天干: 己,
		地支: 未,
	}
	庚申 = 柱{
		天干: 庚,
		地支: 申,
	}
	辛酉 = 柱{
		天干: 辛,
		地支: 酉,
	}
	壬戌 = 柱{
		天干: 壬,
		地支: 戌,
	}
	癸亥 = 柱{
		天干: 癸,
		地支: 亥,
	}
)

type 柱 struct {
	天干 天干
	地支 地支
}
